[
  "obsidian-importer",
  "obsidian-tikzjax",
  "obsidian-git",
  "table-editor-obsidian",
  "obsidian-icon-folder",
  "obsidian-annotator",
  "obsidian-pandoc",
  "automatic-table-of-contents",
  "enhanced-annotations",
  "calendar",
  "obsidian-file-color",
  "code-styler",
  "file-explorer-note-count",
  "better-word-count",
  "novel-word-count",
  "cmdr",
  "omnisearch"
]